ZigEmbeddedGroup/microzig/bsp/wch/ch32/src/chips/CH32V00xxx.svd
        <register>
            <name>CHCTLR2_Input</name>
            <displayName>CHCTLR2_Input</displayName>
            <description>capture/compare mode register 2 (input
            mode)</description>
            <alternateRegister>CHCTLR2_Output</alternateRegister>
            <addressOffset>0x1C</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>IC4F</name>
                <description>Input capture 4 filter</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
            </field>
            <field>
                <name>IC4PSC</name>
                <description>Input capture 4 prescaler</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>CC4S</name>
                <description>Capture/Compare 4
                selection</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>IC3F</name>
                <description>Input capture 3 filter</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
            </field>
            <field>
                <name>IC3PSC</name>
                <description>Input capture 3 prescaler</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>CC3S</name>
                <description>Capture/Compare 3
                selection</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CCER</name>
            <displayName>CCER</displayName>
            <description>capture/compare enable
            register</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CC4P</name>
                <description>Capture/Compare channel 4 output
                Polarity</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC4E</name>
                <description>Capture/Compare channel 4 output
                enable</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3P</name>
                <description>Capture/Compare channel 3 output
                Polarity</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3E</name>
                <description>Capture/Compare channel 3 output
                enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2P</name>
                <description>Capture/Compare channel 2 output
                Polarity</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2E</name>
                <description>Capture/Compare channel 2 output
                enable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1P</name>
                <description>Capture/Compare channel 1 output
                Polarity</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1E</name>
                <description>Capture/Compare channel 1 output
                enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CNT</name>
            <displayName>CNT</displayName>
            <description>counter</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CNT</name>
                <description>counter value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>PSC</name>
            <displayName>PSC</displayName>
            <description>prescaler</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>PSC</name>
                <description>Prescaler value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>ATRLR</name>
            <displayName>ATRLR</displayName>
            <description>auto-reload register</description>
            <addressOffset>0x2C</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0xFFFF</resetValue>
            <fields>
            <field>
                <name>ATRLR</name>
                <description>Auto-reload value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CH1CVR</name>
            <displayName>CH1CVR</displayName>
            <description>capture/compare register 1</description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CH1CVR</name>
                <description>Capture/Compare 1 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CH2CVR</name>
            <displayName>CH2CVR</displayName>
            <description>capture/compare register 2</description>
            <addressOffset>0x38</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CH2CVR</name>
                <description>Capture/Compare 2 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CH3CVR</name>
            <displayName>CH3CVR</displayName>
            <description>capture/compare register 3</description>
            <addressOffset>0x3C</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CH3CVR</name>
                <description>Capture/Compare 3 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CH4CVR</name>
            <displayName>CH4CVR</displayName>
            <description>capture/compare register 4</description>
            <addressOffset>0x40</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CH4CVR</name>
                <description>Capture/Compare 4 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>DMACFGR</name>
            <displayName>DMACFGR</displayName>
            <description>DMA control register</description>
            <addressOffset>0x48</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>DBL</name>
                <description>DMA burst length</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
            </field>
            <field>
                <name>DBA</name>
                <description>DMA base address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>DMAADR</name>
            <displayName>DMAADR</displayName>
            <description>DMA address for full transfer</description>
            <addressOffset>0x4C</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>DMAADR</name>
                <description>DMA register for burst
                accesses</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
